## PostgreSQL Project
In this project, I will be analyzing the 2019 10 Academy learners activity in the Moodle Learning Management System. The moodle LMS is a highly scalable framework, and all students activities are stored in a highly structured database.

The Moodle LMS is a free and open-source learning management system written in PHP and distributed under the GNU General Public License . It is used for blended learning, distance education, flipped classroom and other e-learning projects in schools, universities, workplaces and other sectors.

I will explore the 10 Academy Moodle logs stored in the database together with many other relevant tables. And by the end of the analysis, I will build a Tableau dashboard that illustrates the progress of students across time.

In [1]:
%load_ext sql

In [2]:

from sqlalchemy import create_engine
# connect to database
%sql postgresql://postgres:OGUNFowora1998@localhost/moodle1

'Connected: postgres@moodle1'

In [6]:
import pandas as pd

In [3]:
#connecting sqlalchemy to the database

engine = create_engine('postgresql://postgres:OGUNFowora1998@localhost/moodle1')

In [5]:
x = %sql \d

 * postgresql://postgres:***@localhost/moodle1
894 rows affected.

In [7]:
#determining number of tables
len(pd.read_sql_query('SELECT * FROM pg_stat_user_tables', engine))

448

In [7]:
from pandas import DataFrame
x = DataFrame(x)

In [8]:
x.head(10)

        0                                        1         2         3
0  public             mdl_analytics_indicator_calc     table  postgres
1  public      mdl_analytics_indicator_calc_id_seq  sequence  postgres
2  public                     mdl_analytics_models     table  postgres
3  public              mdl_analytics_models_id_seq  sequence  postgres
4  public                 mdl_analytics_models_log     table  postgres
5  public          mdl_analytics_models_log_id_seq  sequence  postgres
6  public            mdl_analytics_predict_samples     table  postgres
7  public     mdl_analytics_predict_samples_id_seq  sequence  postgres
8  public         mdl_analytics_prediction_actions     table  postgres
9  public  mdl_analytics_prediction_actions_id_seq  sequence  postgres

In [9]:
len(x[x[2] == 'table'])

448

So, there are 448 tables in the database.

## Perusing The MIT tables
MIT Tables: Some selected provided in the challenge document.

In [ ]:
# number of rows

In [8]:
mit_table = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules', 
             'mdl_course_modules', 'mdl_course_modules_completion',
            'mdl_grade_items', 'mdl_grade_grades', 'mdl_grade_categories',
             'mdl_grade_items_history', 'mdl_grade_grades_history',
            'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']


for i in mit_table:
    print('{}  has '.format(i),   (pd.read_sql_query('SELECT COUNT(*) FROM {}'.format(i), engine).values), ' records')

mdl_logstore_standard_log  has  [[417554]]  records
mdl_context  has  [[4359]]  records
mdl_user  has  [[1052]]  records
mdl_course  has  [[15]]  records
mdl_modules  has  [[26]]  records
mdl_course_modules  has  [[290]]  records
mdl_course_modules_completion  has  [[4483]]  records
mdl_grade_items  has  [[113]]  records
mdl_grade_grades  has  [[3643]]  records
mdl_grade_categories  has  [[16]]  records
mdl_grade_items_history  has  [[486]]  records
mdl_grade_grades_history  has  [[7108]]  records
mdl_grade_categories_history  has  [[46]]  records
mdl_forum  has  [[34]]  records
mdl_forum_discussions  has  [[23]]  records
mdl_forum_posts  has  [[131]]  records

In [56]:
#Number of quiz submission by hour of day
pd.read_sql_query('SELECT * FROM mdl_quiz_attempts LIMIT 5', engine)

,id,quiz,userid,attempt,uniqueid,layout,currentpage,preview,state,timestart,timefinish,timemodified,timemodifiedoffline,timecheckstate,sumgrades
0,53,51,45,1,64,"1,0,2,0,3,0,4,0,5,0,6,0,7,0,8,0,9,0,10,0,11,0,...",11,0,finished,1549769058,1549771433,1549771433,0,None,10.0
1,50,51,20,1,61,"1,0,2,0,3,0,4,0,5,0,6,0,7,0,8,0,9,0,10,0,11,0,...",11,0,finished,1549745930,1549747532,1549747532,0,None,6.0
2,34,18,56,1,44,"1,0",0,0,abandoned,1549635258,0,1549639082,0,None,NaN
3,45,51,73,1,56,"1,0,2,0,3,0,4,0,5,0,6,0,7,0,8,0,9,0,10,0,11,0,...",11,0,finished,1549651310,1549652294,1549652294,0,None,8.0
4,35,18,65,1,45,"1,0",0,0,finished,1549639649,1549639813,1549639813,0,None,0.0

In [13]:
quiz_sub = pd.read_sql_query("SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour" , engine)
quiz_sub.head()

   hour  count
0   0.0     29
1   1.0      7
2   2.0     14
3   3.0     10
4   4.0     18

In [22]:
%%sql
SELECT Extract(MONTH FROM to_timestamp(Firstaccess)) AS month FROM mdl_user GROUP BY 1

 * postgresql://postgres:***@localhost/moodle1
7 rows affected.

[(3.0,), (7.0,), (1.0,), (2.0,), (6.0,), (4.0,), (5.0,)]

In [30]:
time_month = pd.read_sql_query("SELECT Extract(MONTH FROM to_timestamp(Firstaccess)) AS month,  SUM(Lastaccess - Firstaccess) AS time FROM mdl_user where Deleted=0 AND Confirmed=1 GROUP BY 1;", engine)
time_month.head(10)

   month          time
0    3.0  2.316844e+08
1    7.0  8.083286e+06
2    1.0  6.144879e+07
3    2.0  1.011122e+09
4    6.0  1.580231e+07
5    4.0  3.154160e+08
6    5.0  8.451505e+07

In [69]:
%%sql 
SELECT userid, COUNT(*) AS count FROM mdl_logstore_standard_log WHERE action = 'loggedin' 
OR action = 'viewed' 
OR action = 'started'
OR action = 'answered'
OR action = 'submitted'
OR action = 'uploaded'
OR action = 'updated'
OR action = 'searched'
OR action = 'resumed'
OR action = 'attempted'
OR action = 'abandoned'
GROUP BY userid limit 5

 * postgresql://postgres:***@localhost/moodle1
5 rows affected.

[(0, 5954), (1, 3), (2, 5273), (3, 5644), (5, 788)]